nxp-appcodehub/dm-frdm33926pnbevm-motor-control-driver-demo-app/frdm33926pnbevm_demo_app/frdmmcxn947_frdm33926pnbevm_demoapp/board/pin_mux.c
	const port_pin_config_t port0_22_pin14_config = {/* Internal pull-up/down resistor is disabled */
			kPORT_PullDisable,
			/* Low internal pull resistor value is selected. */
			kPORT_LowPullResistor,
			/* Fast slew rate is configured */
			kPORT_FastSlewRate,
			/* Passive input filter is disabled */
			kPORT_PassiveFilterDisable,
			/* Open drain output is disabled */
			kPORT_OpenDrainDisable,
			/* Low drive strength is configured */
			kPORT_LowDriveStrength,
			/* Pin is configured as P3_12 */
			kPORT_MuxAlt0,
			/* Digital input enabled */
			kPORT_InputBufferEnable,
			/* Digital input is not inverted */
			kPORT_InputNormal,
			/* Pin Control Register fields [15:0] are not locked */
			kPORT_UnlockRegister};
	/* PORT2_0 (pin 14) is configured as SF_B */
	PORT_SetPinConfig(PORT0, 22U, &port0_22_pin14_config);

	const port_pin_config_t port0_28_pin35_config = {/* Internal pull-up/down resistor is disabled */
			kPORT_PullDisable,
			/* Low internal pull resistor value is selected. */
			kPORT_LowPullResistor,
			/* Fast slew rate is configured */
			kPORT_FastSlewRate,
			/* Passive input filter is disabled */
			kPORT_PassiveFilterDisable,
			/* Open drain output is disabled */
			kPORT_OpenDrainDisable,
			/* Low drive strength is configured */
			kPORT_LowDriveStrength,
			/* Pin is configured as P3_12 */
			kPORT_MuxAlt0,
			/* Digital input enabled */
			kPORT_InputBufferEnable,
			/* Digital input is not inverted */
			kPORT_InputNormal,
			/* Pin Control Register fields [15:0] are not locked */
			kPORT_UnlockRegister};
	/* PORT3_15 (pin 35) is configured as SLEW */
	PORT_SetPinConfig(PORT0, 28U, &port0_28_pin35_config);

	const port_pin_config_t port0_10_pin36_config = {/* Internal pull-up/down resistor is disabled */
			kPORT_PullDisable,
			/* Low internal pull resistor value is selected. */
			kPORT_LowPullResistor,
			/* Fast slew rate is configured */
			kPORT_FastSlewRate,
			/* Passive input filter is disabled */
			kPORT_PassiveFilterDisable,
			/* Open drain output is disabled */
			kPORT_OpenDrainDisable,
			/* Low drive strength is configured */
			kPORT_LowDriveStrength,
			/* Pin is configured as P3_12 */
			kPORT_MuxAlt0,
			/* Digital input enabled */
			kPORT_InputBufferEnable,
			/* Digital input is not inverted */
			kPORT_InputNormal,
			/* Pin Control Register fields [15:0] are not locked */
			kPORT_UnlockRegister};
	/* PORT3_14 (pin 36) is configured as D2B */
	PORT_SetPinConfig(PORT0, 10U, &port0_10_pin36_config);

	const port_pin_config_t port0_27_pin20_config = {/* Internal pull-up/down resistor is disabled */
			kPORT_PullDisable,
			/* Low internal pull resistor value is selected. */
			kPORT_LowPullResistor,
			/* Fast slew rate is configured */
			kPORT_FastSlewRate,
			/* Passive input filter is disabled */
			kPORT_PassiveFilterDisable,
			/* Open drain output is disabled */
			kPORT_OpenDrainDisable,
			/* Low drive strength is configured */
			kPORT_LowDriveStrength,
			/* Pin is configured as P3_12 */
			kPORT_MuxAlt0,
			/* Digital input enabled */
			kPORT_InputBufferEnable,
			/* Digital input is not inverted */
			kPORT_InputNormal,
			/* Pin Control Register fields [15:0] are not locked */
			kPORT_UnlockRegister};
	/* PORT2_6 (pin 20) is configured as INP_INV */
	PORT_SetPinConfig(PORT0, 27U, &port0_27_pin20_config);

	const port_pin_config_t port4_0_pin2_config = {/* Internal pull-up/down resistor is disabled */
			kPORT_PullDisable,
			/* Low internal pull resistor value is selected. */
			kPORT_LowPullResistor,
			/* Fast slew rate is configured */
			kPORT_FastSlewRate,
			/* Passive input filter is disabled */
			kPORT_PassiveFilterDisable,
			/* Open drain output is disabled */
			kPORT_OpenDrainDisable,
			/* Low drive strength is configured */
			kPORT_LowDriveStrength,
			/* Pin is configured as P3_12 */
			kPORT_MuxAlt0,
			/* Digital input enabled */
			kPORT_InputBufferEnable,
			/* Digital input is not inverted */
			kPORT_InputNormal,
			/* Pin Control Register fields [15:0] are not locked */
			kPORT_UnlockRegister};
	/* PORT2_6 (pin 2) is configured as EN */
	PORT_SetPinConfig(PORT4, 0U, &port4_0_pin2_config);


	const port_pin_config_t port4_2_pin63_config = {/* Internal pull-up/down resistor is disabled */
			kPORT_PullDisable,
			/* Low internal pull resistor value is selected. */
			kPORT_LowPullResistor,
			/* Fast slew rate is configured */
			kPORT_FastSlewRate,
			/* Passive input filter is disabled */
			kPORT_PassiveFilterDisable,
			/* Open drain output is disabled */
			kPORT_OpenDrainDisable,
			/* Low drive strength is configured */
			kPORT_LowDriveStrength,
			/* Pin is configured as P3_12 */
			kPORT_MuxAlt0,
			/* Digital input enabled */
			kPORT_InputBufferEnable,
			/* Digital input is not inverted */
			kPORT_InputNormal,
			/* Pin Control Register fields [15:0] are not locked */
			kPORT_UnlockRegister};
	/* PORT1_5 (pin 63) is configured as D1 */
	PORT_SetPinConfig(PORT4, 2U, &port4_2_pin63_config);


	port_pin_config_t port3_12_pin38_config = {/* Internal pull-up/down resistor is disabled */
			kPORT_PullDisable,
			/* Low internal pull resistor value is selected. */
			kPORT_LowPullResistor,
			/* Fast slew rate is configured */
			kPORT_FastSlewRate,
			/* Passive input filter is disabled */
			kPORT_PassiveFilterDisable,
			/* Open drain output is disabled */
			kPORT_OpenDrainDisable,
			/* Low drive strength is configured */
			kPORT_LowDriveStrength,
			/* Pin is configured as P3_12 */
			kPORT_MuxAlt5,
			/* Digital input enabled */
			kPORT_InputBufferEnable,
			/* Digital input is not inverted */
			kPORT_InputNormal,
			/* Pin Control Register fields [15:0] are not locked */
			kPORT_UnlockRegister};
	/* PORT3_12 (pin 38) is configured as PWM1 */
	PORT_SetPinConfig(PORT3, 12U, &port3_12_pin38_config);

	port_pin_config_t port3_13_pin37_config = {/* Internal pull-up/down resistor is disabled */
			kPORT_PullDisable,
			/* Low internal pull resistor value is selected. */
			kPORT_LowPullResistor,
			/* Fast slew rate is configured */
			kPORT_FastSlewRate,
			/* Passive input filter is disabled */
			kPORT_PassiveFilterDisable,
			/* Open drain output is disabled */
			kPORT_OpenDrainDisable,
			/* Low drive strength is configured */
			kPORT_LowDriveStrength,
			/* Pin is configured as P3_12 */
			kPORT_MuxAlt5,
			/* Digital input enabled */
			kPORT_InputBufferEnable,
			/* Digital input is not inverted */
			kPORT_InputNormal,
			/* Pin Control Register fields [15:0] are not locked */
			kPORT_UnlockRegister};
	/* PORT3_13 (pin 37) is configured as PWN2 */
	PORT_SetPinConfig(PORT3, 13U, &port3_13_pin37_config);


	const port_pin_config_t port4_0_pinU12_config = {/* Internal pull-up/down resistor is disabled */
	                                                      kPORT_PullDisable,
	                                                      /* Low internal pull resistor value is selected. */
	                                                      kPORT_LowPullResistor,
	                                                      /* Fast slew rate is configured */
	                                                      kPORT_FastSlewRate,
	                                                      /* Passive input filter is disabled */
	                                                      kPORT_PassiveFilterDisable,
	                                                      /* Open drain output is disabled */
	                                                      kPORT_OpenDrainDisable,
	                                                      /* Low drive strength is configured */
	                                                      kPORT_LowDriveStrength,
	                                                      /* Pin is configured as ADC0_A0 */
	                                                      kPORT_MuxAlt0,
	                                                      /* Digital input disabled; it is required for analog functions */
	                                                      kPORT_InputBufferDisable,
	                                                      /* Digital input is not inverted */
	                                                      kPORT_InputNormal,
	                                                      /* Pin Control Register fields [15:0] are not locked */
	                                                      kPORT_UnlockRegister};
	    /* PORT4_0 (pin U12) is configured as ADC0_A0 */
	    PORT_SetPinConfig(PORT4, 0U, &port4_0_pinU12_config);

    const port_pin_config_t port1_2_pinF8_config = {/* Internal pull-up/down resistor is disabled */
													kPORT_PullDisable,
													/* Low internal pull resistor value is selected. */
													kPORT_LowPullResistor,
													/* Fast slew rate is configured */
													kPORT_FastSlewRate,
													/* Passive input filter is disabled */
													kPORT_PassiveFilterDisable,
													/* Open drain output is disabled */
													kPORT_OpenDrainDisable,
													/* Low drive strength is configured */
													kPORT_LowDriveStrength,
													/* Pin is configured as PIO3_4 */
													kPORT_MuxAlt0,
													/* Digital input enabled */
													kPORT_InputBufferEnable,
													/* Digital input is not inverted */
													kPORT_InputNormal,
													/* Pin Control Register fields [15:0] are not locked */
													kPORT_UnlockRegister};
    /* PORT0_29 (pin F8) is configured as PIO0_29 */
    PORT_SetPinConfig(PORT1, 2U, &port1_2_pinF8_config);

